#!/usr/bin/python3
# -*- coding: utf-8 -*-
from __future__ import unicode_literals

"""Имитация текста

Прочитайте файл, указанный в командной строке.
Используйте str.split() (без аргументов) для получения всех слов в файле.
Вместо того, чтобы читать файл построчно, проще считать
его в одну гигантскую строку и применить к нему split() один раз.

Создайте "имитационный" словарь, который связывает каждое слово
со списком всех слов, которые непосредственно следуют за этим словом в файле.
Список слов может быть в любом порядке и должен включать дубликаты. 

Так, например, для текста "Привет, мир! Привет, Вселенная!" мы получим такой
имитационный словарь:
{'': ['Привет,'], 'Привет,': ['мир!', 'Вселенная!'], 'мир!': ['Привет,']}
Будем считать, в качестве ключа для первого слова в файле используется пустая строка.

С помощью имитационного словаря довольно просто генерировать случайные тексты, 
имитирующие оригинальный. Возьмите слово, посмотрите какие слова могут за ним, 
выберите одно из них наугад, выведите его и используйте это слово 
в следующей итерации.

Используйте пустую строку в качестве ключа для первого слова.
Если вы когда-нибудь застрянете на слове, которого нет в словаре,
вернетесь к пустой строке, чтобы продолжать генерацию текста.

Примечание: стандартный python-модуль random включает в себя метод 
random.choice(list), который выбирает случайный элемент из непустого списка.

"""

import random
import sys
import codecs

filename = 'Братья Карамазовы.txt'

def mimic_dict(filename):
    """Возвращает имитационный словарь, сопоставляющий каждое слово 
    со списом слов, которые непосредственно следуют за ним в тексте"""
    
    f = codecs.open(filename, 'r')
    f.seek(0)
    word_list = f.read().split()

    res = {}
    prev = ''

    for x in word_list:
        if prev in res:
            res[prev].append(x)
        else:
            res[prev] = [x, ]
        prev = x
    return res


def print_mimic(mimic_dict, word):
    """Принимает в качестве аргументов имитационный словарь и начальное слово,
    выводит 200 случайных слов."""
    
    res = []

    for i in range(200):
        if not word in mimic_dict:
            word = ''
        word = random.choice(mimic_dict[word])
        res.append(word)

    print(' '.join(res))


def main():


    d = mimic_dict('Братья Карамазовы.txt')
    print_mimic(d, 'Анна')


if __name__ == '__main__':
    main()
